#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-cADGkfMCFZAfvXhv

Waiting for the plan to start...

Terraform v1.7.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_kiota will be updated in-place
  ~ resource "github_repository" "quarkus_kiota" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
        id                          = "quarkus-kiota"
        name                        = "quarkus-kiota"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_langchain4j will be updated in-place
  ~ resource "github_repository" "quarkus_langchain4j" {
      - has_discussions             = true -> null
        id                          = "quarkus-langchain4j"
        name                        = "quarkus-langchain4j"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_ngrok will be updated in-place
  ~ resource "github_repository" "quarkus_ngrok" {
      - homepage_url                = "https://docs.quarkiverse.io/quarkus-ngrok/dev/index.html" -> null
        id                          = "quarkus-ngrok"
        name                        = "quarkus-ngrok"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_collaborator.quarkus_config_extensions["radcortez"] will be created
  + resource "github_repository_collaborator" "quarkus_config_extensions" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "quarkus-config-extensions"
      + username                    = "radcortez"
    }

  # github_team_membership.quarkus_hivemq_client["codepitbull"] will be created
  + resource "github_team_membership" "quarkus_hivemq_client" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4651319"
      + username = "codepitbull"
    }

  # github_team_membership.quarkus_univocity_parsers["aruffie"] will be created
  + resource "github_team_membership" "quarkus_univocity_parsers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4707008"
      + username = "aruffie"
    }

Plan: 3 to add, 3 to change, 0 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*